GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 0E07h
// bitfield definitions
SMT1WINPPS_PIN_POSN                      equ 0000h
SMT1WINPPS_PIN_POSITION                  equ 0000h
SMT1WINPPS_PIN_SIZE                      equ 0003h
SMT1WINPPS_PIN_LENGTH                    equ 0003h
SMT1WINPPS_PIN_MASK                      equ 0007h
SMT1WINPPS_PORT_POSN                     equ 0003h
SMT1WINPPS_PORT_POSITION                 equ 0003h
SMT1WINPPS_PORT_SIZE                     equ 0003h
SMT1WINPPS_PORT_LENGTH                   equ 0003h
SMT1WINPPS_PORT_MASK                     equ 0038h
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0006h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0006h
SMT1WINPPS_SMT1WINPPS_MASK               equ 003Fh
SMT1WINPPS_SMT1WINPPS0_POSN              equ 0000h
SMT1WINPPS_SMT1WINPPS0_POSITION          equ 0000h
SMT1WINPPS_SMT1WINPPS0_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS0_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS0_MASK              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSN              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSITION          equ 0001h
SMT1WINPPS_SMT1WINPPS1_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS1_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS1_MASK              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSN              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSITION          equ 0002h
SMT1WINPPS_SMT1WINPPS2_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS2_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS2_MASK              equ 0004h
SMT1WINPPS_SMT1WINPPS3_POSN              equ 0003h
SMT1WINPPS_SMT1WINPPS3_POSITION          equ 0003h
SMT1WINPPS_SMT1WINPPS3_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS3_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS3_MASK              equ 0008h
SMT1WINPPS_SMT1WINPPS4_POSN              equ 0004h
SMT1WINPPS_SMT1WINPPS4_POSITION          equ 0004h
SMT1WINPPS_SMT1WINPPS4_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS4_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS4_MASK              equ 0010h
SMT1WINPPS_SMT1WINPPS5_POSN              equ 0005h
SMT1WINPPS_SMT1WINPPS5_POSITION          equ 0005h
SMT1WINPPS_SMT1WINPPS5_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS5_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS5_MASK              equ 0020h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 0E08h
// bitfield definitions
SMT1SIGPPS_PIN_POSN                      equ 0000h
SMT1SIGPPS_PIN_POSITION                  equ 0000h
SMT1SIGPPS_PIN_SIZE                      equ 0003h
SMT1SIGPPS_PIN_LENGTH                    equ 0003h
SMT1SIGPPS_PIN_MASK                      equ 0007h
SMT1SIGPPS_PORT_POSN                     equ 0003h
SMT1SIGPPS_PORT_POSITION                 equ 0003h
SMT1SIGPPS_PORT_SIZE                     equ 0003h
SMT1SIGPPS_PORT_LENGTH                   equ 0003h
SMT1SIGPPS_PORT_MASK                     equ 0038h
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0006h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0006h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 003Fh
SMT1SIGPPS_SMT1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMT1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMT1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_MASK              equ 0010h
SMT1SIGPPS_SMT1SIGPPS5_POSN              equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_POSITION          equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_MASK              equ 0020h

// Register: SMT2WINPPS
#define SMT2WINPPS SMT2WINPPS
SMT2WINPPS                               equ 0E09h
// bitfield definitions
SMT2WINPPS_PIN_POSN                      equ 0000h
SMT2WINPPS_PIN_POSITION                  equ 0000h
SMT2WINPPS_PIN_SIZE                      equ 0003h
SMT2WINPPS_PIN_LENGTH                    equ 0003h
SMT2WINPPS_PIN_MASK                      equ 0007h
SMT2WINPPS_PORT_POSN                     equ 0003h
SMT2WINPPS_PORT_POSITION                 equ 0003h
SMT2WINPPS_PORT_SIZE                     equ 0003h
SMT2WINPPS_PORT_LENGTH                   equ 0003h
SMT2WINPPS_PORT_MASK                     equ 0038h
SMT2WINPPS_SMT2WINPPS_POSN               equ 0000h
SMT2WINPPS_SMT2WINPPS_POSITION           equ 0000h
SMT2WINPPS_SMT2WINPPS_SIZE               equ 0006h
SMT2WINPPS_SMT2WINPPS_LENGTH             equ 0006h
SMT2WINPPS_SMT2WINPPS_MASK               equ 003Fh
SMT2WINPPS_SMT2WINPPS0_POSN              equ 0000h
SMT2WINPPS_SMT2WINPPS0_POSITION          equ 0000h
SMT2WINPPS_SMT2WINPPS0_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS0_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS0_MASK              equ 0001h
SMT2WINPPS_SMT2WINPPS1_POSN              equ 0001h
SMT2WINPPS_SMT2WINPPS1_POSITION          equ 0001h
SMT2WINPPS_SMT2WINPPS1_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS1_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS1_MASK              equ 0002h
SMT2WINPPS_SMT2WINPPS2_POSN              equ 0002h
SMT2WINPPS_SMT2WINPPS2_POSITION          equ 0002h
SMT2WINPPS_SMT2WINPPS2_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS2_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS2_MASK              equ 0004h
SMT2WINPPS_SMT2WINPPS3_POSN              equ 0003h
SMT2WINPPS_SMT2WINPPS3_POSITION          equ 0003h
SMT2WINPPS_SMT2WINPPS3_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS3_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS3_MASK              equ 0008h
SMT2WINPPS_SMT2WINPPS4_POSN              equ 0004h
SMT2WINPPS_SMT2WINPPS4_POSITION          equ 0004h
SMT2WINPPS_SMT2WINPPS4_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS4_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS4_MASK              equ 0010h
SMT2WINPPS_SMT2WINPPS5_POSN              equ 0005h
SMT2WINPPS_SMT2WINPPS5_POSITION          equ 0005h
SMT2WINPPS_SMT2WINPPS5_SIZE              equ 0001h
SMT2WINPPS_SMT2WINPPS5_LENGTH            equ 0001h
SMT2WINPPS_SMT2WINPPS5_MASK              equ 0020h

// Register: SMT2SIGPPS
#define SMT2SIGPPS SMT2SIGPPS
SMT2SIGPPS                               equ 0E0Ah
// bitfield definitions
SMT2SIGPPS_PIN_POSN                      equ 0000h
SMT2SIGPPS_PIN_POSITION                  equ 0000h
SMT2SIGPPS_PIN_SIZE                      equ 0003h
SMT2SIGPPS_PIN_LENGTH                    equ 0003h
SMT2SIGPPS_PIN_MASK                      equ 0007h
SMT2SIGPPS_PORT_POSN                     equ 0003h
SMT2SIGPPS_PORT_POSITION                 equ 0003h
SMT2SIGPPS_PORT_SIZE                     equ 0003h
SMT2SIGPPS_PORT_LENGTH                   equ 0003h
SMT2SIGPPS_PORT_MASK                     equ 0038h
SMT2SIGPPS_SMT2SIGPPS_POSN               equ 0000h
SMT2SIGPPS_SMT2SIGPPS_POSITION           equ 0000h
SMT2SIGPPS_SMT2SIGPPS_SIZE               equ 0006h
SMT2SIGPPS_SMT2SIGPPS_LENGTH             equ 0006h
SMT2SIGPPS_SMT2SIGPPS_MASK               equ 003Fh
SMT2SIGPPS_SMT2SIGPPS0_POSN              equ 0000h
SMT2SIGPPS_SMT2SIGPPS0_POSITION          equ 0000h
SMT2SIGPPS_SMT2SIGPPS0_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS0_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS0_MASK              equ 0001h
SMT2SIGPPS_SMT2SIGPPS1_POSN              equ 0001h
SMT2SIGPPS_SMT2SIGPPS1_POSITION          equ 0001h
SMT2SIGPPS_SMT2SIGPPS1_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS1_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS1_MASK              equ 0002h
SMT2SIGPPS_SMT2SIGPPS2_POSN              equ 0002h
SMT2SIGPPS_SMT2SIGPPS2_POSITION          equ 0002h
SMT2SIGPPS_SMT2SIGPPS2_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS2_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS2_MASK              equ 0004h
SMT2SIGPPS_SMT2SIGPPS3_POSN              equ 0003h
SMT2SIGPPS_SMT2SIGPPS3_POSITION          equ 0003h
SMT2SIGPPS_SMT2SIGPPS3_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS3_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS3_MASK              equ 0008h
SMT2SIGPPS_SMT2SIGPPS4_POSN              equ 0004h
SMT2SIGPPS_SMT2SIGPPS4_POSITION          equ 0004h
SMT2SIGPPS_SMT2SIGPPS4_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS4_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS4_MASK              equ 0010h
SMT2SIGPPS_SMT2SIGPPS5_POSN              equ 0005h
SMT2SIGPPS_SMT2SIGPPS5_POSITION          equ 0005h
SMT2SIGPPS_SMT2SIGPPS5_SIZE              equ 0001h
SMT2SIGPPS_SMT2SIGPPS5_LENGTH            equ 0001h
SMT2SIGPPS_SMT2SIGPPS5_MASK              equ 0020h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 0E0Bh
// bitfield definitions
CWG1PPS_PIN_POSN                         equ 0000h
CWG1PPS_PIN_POSITION                     equ 0000h
CWG1PPS_PIN_SIZE                         equ 0003h
CWG1PPS_PIN_LENGTH                       equ 0003h
CWG1PPS_PIN_MASK                         equ 0007h
CWG1PPS_PORT_POSN                        equ 0003h
CWG1PPS_PORT_POSITION                    equ 0003h
CWG1PPS_PORT_SIZE                        equ 0002h
CWG1PPS_PORT_LENGTH                      equ 0002h
CWG1PPS_PORT_MASK                        equ 0018h
CWG1PPS_CWGINPPS_POSN                    equ 0000h
CWG1PPS_CWGINPPS_POSITION                equ 0000h
CWG1PPS_CWGINPPS_SIZE                    equ 0006h
CWG1PPS_CWGINPPS_LENGTH                  equ 0006h
CWG1PPS_CWGINPPS_MASK                    equ 003Fh
CWG1PPS_CWGINPPS0_POSN                   equ 0000h
CWG1PPS_CWGINPPS0_POSITION               equ 0000h
CWG1PPS_CWGINPPS0_SIZE                   equ 0001h
CWG1PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS0_MASK                   equ 0001h
CWG1PPS_CWGINPPS1_POSN                   equ 0001h
CWG1PPS_CWGINPPS1_POSITION               equ 0001h
CWG1PPS_CWGINPPS1_SIZE                   equ 0001h
CWG1PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS1_MASK                   equ 0002h
CWG1PPS_CWGINPPS2_POSN                   equ 0002h
CWG1PPS_CWGINPPS2_POSITION               equ 0002h
CWG1PPS_CWGINPPS2_SIZE                   equ 0001h
CWG1PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS2_MASK                   equ 0004h
CWG1PPS_CWGINPPS3_POSN                   equ 0003h
CWG1PPS_CWGINPPS3_POSITION               equ 0003h
CWG1PPS_CWGINPPS3_SIZE                   equ 0001h
CWG1PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS3_MASK                   equ 0008h
CWG1PPS_CWGINPPS4_POSN                   equ 0004h
CWG1PPS_CWGINPPS4_POSITION               equ 0004h
CWG1PPS_CWGINPPS4_SIZE                   equ 0001h
CWG1PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS4_MASK                   equ 0010h
CWG1PPS_CWG1INPPS_POSN                   equ 0000h
CWG1PPS_CWG1INPPS_POSITION               equ 0000h
CWG1PPS_CWG1INPPS_SIZE                   equ 0006h
CWG1PPS_CWG1INPPS_LENGTH                 equ 0006h
CWG1PPS_CWG1INPPS_MASK                   equ 003Fh
CWG1PPS_CWG1INPPS0_POSN                  equ 0000h
CWG1PPS_CWG1INPPS0_POSITION              equ 0000h
CWG1PPS_CWG1INPPS0_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS0_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS0_MASK                  equ 0001h
CWG1PPS_CWG1INPPS1_POSN                  equ 0001h
CWG1PPS_CWG1INPPS1_POSITION              equ 0001h
CWG1PPS_CWG1INPPS1_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS1_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS1_MASK                  equ 0002h
CWG1PPS_CWG1INPPS2_POSN                  equ 0002h
CWG1PPS_CWG1INPPS2_POSITION              equ 0002h
CWG1PPS_CWG1INPPS2_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS2_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS2_MASK                  equ 0004h
CWG1PPS_CWG1INPPS3_POSN                  equ 0003h
CWG1PPS_CWG1INPPS3_POSITION              equ 0003h
CWG1PPS_CWG1INPPS3_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS3_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS3_MASK                  equ 0008h
CWG1PPS_CWG1INPPS4_POSN                  equ 0004h
CWG1PPS_CWG1INPPS4_POSITION              equ 0004h
CWG1PPS_CWG1INPPS4_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS4_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS4_MASK                  equ 0010h

// Register: MDCARLPPS
#define MDCARLPPS MDCARLPPS
MDCARLPPS                                equ 0E0Ch
// bitfield definitions
MDCARLPPS_PIN_POSN                       equ 0000h
MDCARLPPS_PIN_POSITION                   equ 0000h
MDCARLPPS_PIN_SIZE                       equ 0003h
MDCARLPPS_PIN_LENGTH                     equ 0003h
MDCARLPPS_PIN_MASK                       equ 0007h
MDCARLPPS_PORT_POSN                      equ 0003h
MDCARLPPS_PORT_POSITION                  equ 0003h
MDCARLPPS_PORT_SIZE                      equ 0003h
MDCARLPPS_PORT_LENGTH                    equ 0003h
MDCARLPPS_PORT_MASK                      equ 0038h
MDCARLPPS_MDCARLPPS_POSN                 equ 0000h
MDCARLPPS_MDCARLPPS_POSITION             equ 0000h
MDCARLPPS_MDCARLPPS_SIZE                 equ 0006h
MDCARLPPS_MDCARLPPS_LENGTH               equ 0006h
MDCARLPPS_MDCARLPPS_MASK                 equ 003Fh
MDCARLPPS_MDCARLPPS0_POSN                equ 0000h
MDCARLPPS_MDCARLPPS0_POSITION            equ 0000h
MDCARLPPS_MDCARLPPS0_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS0_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS0_MASK                equ 0001h
MDCARLPPS_MDCARLPPS1_POSN                equ 0001h
MDCARLPPS_MDCARLPPS1_POSITION            equ 0001h
MDCARLPPS_MDCARLPPS1_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS1_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS1_MASK                equ 0002h
MDCARLPPS_MDCARLPPS2_POSN                equ 0002h
MDCARLPPS_MDCARLPPS2_POSITION            equ 0002h
MDCARLPPS_MDCARLPPS2_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS2_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS2_MASK                equ 0004h
MDCARLPPS_MDCARLPPS3_POSN                equ 0003h
MDCARLPPS_MDCARLPPS3_POSITION            equ 0003h
MDCARLPPS_MDCARLPPS3_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS3_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS3_MASK                equ 0008h
MDCARLPPS_MDCARLPPS4_POSN                equ 0004h
MDCARLPPS_MDCARLPPS4_POSITION            equ 0004h
MDCARLPPS_MDCARLPPS4_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS4_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS4_MASK                equ 0010h
MDCARLPPS_MDCARLPPS5_POSN                equ 0005h
MDCARLPPS_MDCARLPPS5_POSITION            equ 0005h
MDCARLPPS_MDCARLPPS5_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS5_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS5_MASK                equ 0020h

// Register: MDCARHPPS
#define MDCARHPPS MDCARHPPS
MDCARHPPS                                equ 0E0Dh
// bitfield definitions
MDCARHPPS_PIN_POSN                       equ 0000h
MDCARHPPS_PIN_POSITION                   equ 0000h
MDCARHPPS_PIN_SIZE                       equ 0003h
MDCARHPPS_PIN_LENGTH                     equ 0003h
MDCARHPPS_PIN_MASK                       equ 0007h
MDCARHPPS_PORT_POSN                      equ 0003h
MDCARHPPS_PORT_POSITION                  equ 0003h
MDCARHPPS_PORT_SIZE                      equ 0003h
MDCARHPPS_PORT_LENGTH                    equ 0003h
MDCARHPPS_PORT_MASK                      equ 0038h
MDCARHPPS_MDCARHPPS_POSN                 equ 0000h
MDCARHPPS_MDCARHPPS_POSITION             equ 0000h
MDCARHPPS_MDCARHPPS_SIZE                 equ 0006h
MDCARHPPS_MDCARHPPS_LENGTH               equ 0006h
MDCARHPPS_MDCARHPPS_MASK                 equ 003Fh
MDCARHPPS_MDCARHPPS0_POSN                equ 0000h
MDCARHPPS_MDCARHPPS0_POSITION            equ 0000h
MDCARHPPS_MDCARHPPS0_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS0_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS0_MASK                equ 0001h
MDCARHPPS_MDCARHPPS1_POSN                equ 0001h
MDCARHPPS_MDCARHPPS1_POSITION            equ 0001h
MDCARHPPS_MDCARHPPS1_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS1_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS1_MASK                equ 0002h
MDCARHPPS_MDCARHPPS2_POSN                equ 0002h
MDCARHPPS_MDCARHPPS2_POSITION            equ 0002h
MDCARHPPS_MDCARHPPS2_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS2_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS2_MASK                equ 0004h
MDCARHPPS_MDCARHPPS3_POSN                equ 0003h
MDCARHPPS_MDCARHPPS3_POSITION            equ 0003h
MDCARHPPS_MDCARHPPS3_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS3_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS3_MASK                equ 0008h
MDCARHPPS_MDCARHPPS4_POSN                equ 0004h
MDCARHPPS_MDCARHPPS4_POSITION            equ 0004h
MDCARHPPS_MDCARHPPS4_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS4_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS4_MASK                equ 0010h
MDCARHPPS_MDCARHPPS5_POSN                equ 0005h
MDCARHPPS_MDCARHPPS5_POSITION            equ 0005h
MDCARHPPS_MDCARHPPS5_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS5_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS5_MASK                equ 0020h

// Register: MDSRCPPS
#define MDSRCPPS MDSRCPPS
MDSRCPPS                                 equ 0E0Eh
// bitfield definitions
MDSRCPPS_PIN_POSN                        equ 0000h
MDSRCPPS_PIN_POSITION                    equ 0000h
MDSRCPPS_PIN_SIZE                        equ 0003h
MDSRCPPS_PIN_LENGTH                      equ 0003h
MDSRCPPS_PIN_MASK                        equ 0007h
MDSRCPPS_PORT_POSN                       equ 0003h
MDSRCPPS_PORT_POSITION                   equ 0003h
MDSRCPPS_PORT_SIZE                       equ 0003h
MDSRCPPS_PORT_LENGTH                     equ 0003h
MDSRCPPS_PORT_MASK                       equ 0038h
MDSRCPPS_MDSRCPPS_POSN                   equ 0000h
MDSRCPPS_MDSRCPPS_POSITION               equ 0000h
MDSRCPPS_MDSRCPPS_SIZE                   equ 0006h
MDSRCPPS_MDSRCPPS_LENGTH                 equ 0006h
MDSRCPPS_MDSRCPPS_MASK                   equ 003Fh
MDSRCPPS_MDSRCPPS0_POSN                  equ 0000h
MDSRCPPS_MDSRCPPS0_POSITION              equ 0000h
MDSRCPPS_MDSRCPPS0_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS0_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS0_MASK                  equ 0001h
MDSRCPPS_MDSRCPPS1_POSN                  equ 0001h
MDSRCPPS_MDSRCPPS1_POSITION              equ 0001h
MDSRCPPS_MDSRCPPS1_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS1_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS1_MASK                  equ 0002h
MDSRCPPS_MDSRCPPS2_POSN                  equ 0002h
MDSRCPPS_MDSRCPPS2_POSITION              equ 0002h
MDSRCPPS_MDSRCPPS2_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS2_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS2_MASK                  equ 0004h
MDSRCPPS_MDSRCPPS3_POSN                  equ 0003h
MDSRCPPS_MDSRCPPS3_POSITION              equ 0003h
MDSRCPPS_MDSRCPPS3_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS3_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS3_MASK                  equ 0008h
MDSRCPPS_MDSRCPPS4_POSN                  equ 0004h
MDSRCPPS_MDSRCPPS4_POSITION              equ 0004h
MDSRCPPS_MDSRCPPS4_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS4_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS4_MASK                  equ 0010h
MDSRCPPS_MDSRCPPS5_POSN                  equ 0005h
MDSRCPPS_MDSRCPPS5_POSITION              equ 0005h
MDSRCPPS_MDSRCPPS5_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS5_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS5_MASK                  equ 0020h

