GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 0E0Fh
// bitfield definitions
RX1PPS_PIN_POSN                          equ 0000h
RX1PPS_PIN_POSITION                      equ 0000h
RX1PPS_PIN_SIZE                          equ 0003h
RX1PPS_PIN_LENGTH                        equ 0003h
RX1PPS_PIN_MASK                          equ 0007h
RX1PPS_PORT_POSN                         equ 0003h
RX1PPS_PORT_POSITION                     equ 0003h
RX1PPS_PORT_SIZE                         equ 0002h
RX1PPS_PORT_LENGTH                       equ 0002h
RX1PPS_PORT_MASK                         equ 0018h
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0006h
RX1PPS_RX1PPS_LENGTH                     equ 0006h
RX1PPS_RX1PPS_MASK                       equ 003Fh
RX1PPS_RX1PPS0_POSN                      equ 0000h
RX1PPS_RX1PPS0_POSITION                  equ 0000h
RX1PPS_RX1PPS0_SIZE                      equ 0001h
RX1PPS_RX1PPS0_LENGTH                    equ 0001h
RX1PPS_RX1PPS0_MASK                      equ 0001h
RX1PPS_RX1PPS1_POSN                      equ 0001h
RX1PPS_RX1PPS1_POSITION                  equ 0001h
RX1PPS_RX1PPS1_SIZE                      equ 0001h
RX1PPS_RX1PPS1_LENGTH                    equ 0001h
RX1PPS_RX1PPS1_MASK                      equ 0002h
RX1PPS_RX1PPS2_POSN                      equ 0002h
RX1PPS_RX1PPS2_POSITION                  equ 0002h
RX1PPS_RX1PPS2_SIZE                      equ 0001h
RX1PPS_RX1PPS2_LENGTH                    equ 0001h
RX1PPS_RX1PPS2_MASK                      equ 0004h
RX1PPS_RX1PPS3_POSN                      equ 0003h
RX1PPS_RX1PPS3_POSITION                  equ 0003h
RX1PPS_RX1PPS3_SIZE                      equ 0001h
RX1PPS_RX1PPS3_LENGTH                    equ 0001h
RX1PPS_RX1PPS3_MASK                      equ 0008h
RX1PPS_RX1PPS4_POSN                      equ 0004h
RX1PPS_RX1PPS4_POSITION                  equ 0004h
RX1PPS_RX1PPS4_SIZE                      equ 0001h
RX1PPS_RX1PPS4_LENGTH                    equ 0001h
RX1PPS_RX1PPS4_MASK                      equ 0010h

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 0E10h
// bitfield definitions
CK1PPS_PIN_POSN                          equ 0000h
CK1PPS_PIN_POSITION                      equ 0000h
CK1PPS_PIN_SIZE                          equ 0003h
CK1PPS_PIN_LENGTH                        equ 0003h
CK1PPS_PIN_MASK                          equ 0007h
CK1PPS_PORT_POSN                         equ 0003h
CK1PPS_PORT_POSITION                     equ 0003h
CK1PPS_PORT_SIZE                         equ 0002h
CK1PPS_PORT_LENGTH                       equ 0002h
CK1PPS_PORT_MASK                         equ 0018h
CK1PPS_TX1PPS_POSN                       equ 0000h
CK1PPS_TX1PPS_POSITION                   equ 0000h
CK1PPS_TX1PPS_SIZE                       equ 0006h
CK1PPS_TX1PPS_LENGTH                     equ 0006h
CK1PPS_TX1PPS_MASK                       equ 003Fh
CK1PPS_TX1PPS0_POSN                      equ 0000h
CK1PPS_TX1PPS0_POSITION                  equ 0000h
CK1PPS_TX1PPS0_SIZE                      equ 0001h
CK1PPS_TX1PPS0_LENGTH                    equ 0001h
CK1PPS_TX1PPS0_MASK                      equ 0001h
CK1PPS_TX1PPS1_POSN                      equ 0001h
CK1PPS_TX1PPS1_POSITION                  equ 0001h
CK1PPS_TX1PPS1_SIZE                      equ 0001h
CK1PPS_TX1PPS1_LENGTH                    equ 0001h
CK1PPS_TX1PPS1_MASK                      equ 0002h
CK1PPS_TX1PPS2_POSN                      equ 0002h
CK1PPS_TX1PPS2_POSITION                  equ 0002h
CK1PPS_TX1PPS2_SIZE                      equ 0001h
CK1PPS_TX1PPS2_LENGTH                    equ 0001h
CK1PPS_TX1PPS2_MASK                      equ 0004h
CK1PPS_TX1PPS3_POSN                      equ 0003h
CK1PPS_TX1PPS3_POSITION                  equ 0003h
CK1PPS_TX1PPS3_SIZE                      equ 0001h
CK1PPS_TX1PPS3_LENGTH                    equ 0001h
CK1PPS_TX1PPS3_MASK                      equ 0008h
CK1PPS_TX1PPS4_POSN                      equ 0004h
CK1PPS_TX1PPS4_POSITION                  equ 0004h
CK1PPS_TX1PPS4_SIZE                      equ 0001h
CK1PPS_TX1PPS4_LENGTH                    equ 0001h
CK1PPS_TX1PPS4_MASK                      equ 0010h

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 0E11h
// bitfield definitions
RX2PPS_PIN_POSN                          equ 0000h
RX2PPS_PIN_POSITION                      equ 0000h
RX2PPS_PIN_SIZE                          equ 0003h
RX2PPS_PIN_LENGTH                        equ 0003h
RX2PPS_PIN_MASK                          equ 0007h
RX2PPS_PORT_POSN                         equ 0003h
RX2PPS_PORT_POSITION                     equ 0003h
RX2PPS_PORT_SIZE                         equ 0003h
RX2PPS_PORT_LENGTH                       equ 0003h
RX2PPS_PORT_MASK                         equ 0038h
RX2PPS_RX2PPS_POSN                       equ 0000h
RX2PPS_RX2PPS_POSITION                   equ 0000h
RX2PPS_RX2PPS_SIZE                       equ 0006h
RX2PPS_RX2PPS_LENGTH                     equ 0006h
RX2PPS_RX2PPS_MASK                       equ 003Fh
RX2PPS_RX2PPS0_POSN                      equ 0000h
RX2PPS_RX2PPS0_POSITION                  equ 0000h
RX2PPS_RX2PPS0_SIZE                      equ 0001h
RX2PPS_RX2PPS0_LENGTH                    equ 0001h
RX2PPS_RX2PPS0_MASK                      equ 0001h
RX2PPS_RX2PPS1_POSN                      equ 0001h
RX2PPS_RX2PPS1_POSITION                  equ 0001h
RX2PPS_RX2PPS1_SIZE                      equ 0001h
RX2PPS_RX2PPS1_LENGTH                    equ 0001h
RX2PPS_RX2PPS1_MASK                      equ 0002h
RX2PPS_RX2PPS2_POSN                      equ 0002h
RX2PPS_RX2PPS2_POSITION                  equ 0002h
RX2PPS_RX2PPS2_SIZE                      equ 0001h
RX2PPS_RX2PPS2_LENGTH                    equ 0001h
RX2PPS_RX2PPS2_MASK                      equ 0004h
RX2PPS_RX2PPS3_POSN                      equ 0003h
RX2PPS_RX2PPS3_POSITION                  equ 0003h
RX2PPS_RX2PPS3_SIZE                      equ 0001h
RX2PPS_RX2PPS3_LENGTH                    equ 0001h
RX2PPS_RX2PPS3_MASK                      equ 0008h
RX2PPS_RX2PPS4_POSN                      equ 0004h
RX2PPS_RX2PPS4_POSITION                  equ 0004h
RX2PPS_RX2PPS4_SIZE                      equ 0001h
RX2PPS_RX2PPS4_LENGTH                    equ 0001h
RX2PPS_RX2PPS4_MASK                      equ 0010h
RX2PPS_RX2PPS5_POSN                      equ 0005h
RX2PPS_RX2PPS5_POSITION                  equ 0005h
RX2PPS_RX2PPS5_SIZE                      equ 0001h
RX2PPS_RX2PPS5_LENGTH                    equ 0001h
RX2PPS_RX2PPS5_MASK                      equ 0020h

// Register: CK2PPS
#define CK2PPS CK2PPS
CK2PPS                                   equ 0E12h
// bitfield definitions
CK2PPS_PIN_POSN                          equ 0000h
CK2PPS_PIN_POSITION                      equ 0000h
CK2PPS_PIN_SIZE                          equ 0003h
CK2PPS_PIN_LENGTH                        equ 0003h
CK2PPS_PIN_MASK                          equ 0007h
CK2PPS_PORT_POSN                         equ 0003h
CK2PPS_PORT_POSITION                     equ 0003h
CK2PPS_PORT_SIZE                         equ 0003h
CK2PPS_PORT_LENGTH                       equ 0003h
CK2PPS_PORT_MASK                         equ 0038h
CK2PPS_TX2PPS_POSN                       equ 0000h
CK2PPS_TX2PPS_POSITION                   equ 0000h
CK2PPS_TX2PPS_SIZE                       equ 0006h
CK2PPS_TX2PPS_LENGTH                     equ 0006h
CK2PPS_TX2PPS_MASK                       equ 003Fh
CK2PPS_TX2PPS0_POSN                      equ 0000h
CK2PPS_TX2PPS0_POSITION                  equ 0000h
CK2PPS_TX2PPS0_SIZE                      equ 0001h
CK2PPS_TX2PPS0_LENGTH                    equ 0001h
CK2PPS_TX2PPS0_MASK                      equ 0001h
CK2PPS_TX2PPS1_POSN                      equ 0001h
CK2PPS_TX2PPS1_POSITION                  equ 0001h
CK2PPS_TX2PPS1_SIZE                      equ 0001h
CK2PPS_TX2PPS1_LENGTH                    equ 0001h
CK2PPS_TX2PPS1_MASK                      equ 0002h
CK2PPS_TX2PPS2_POSN                      equ 0002h
CK2PPS_TX2PPS2_POSITION                  equ 0002h
CK2PPS_TX2PPS2_SIZE                      equ 0001h
CK2PPS_TX2PPS2_LENGTH                    equ 0001h
CK2PPS_TX2PPS2_MASK                      equ 0004h
CK2PPS_TX2PPS3_POSN                      equ 0003h
CK2PPS_TX2PPS3_POSITION                  equ 0003h
CK2PPS_TX2PPS3_SIZE                      equ 0001h
CK2PPS_TX2PPS3_LENGTH                    equ 0001h
CK2PPS_TX2PPS3_MASK                      equ 0008h
CK2PPS_TX2PPS4_POSN                      equ 0004h
CK2PPS_TX2PPS4_POSITION                  equ 0004h
CK2PPS_TX2PPS4_SIZE                      equ 0001h
CK2PPS_TX2PPS4_LENGTH                    equ 0001h
CK2PPS_TX2PPS4_MASK                      equ 0010h
CK2PPS_TX2PPS5_POSN                      equ 0005h
CK2PPS_TX2PPS5_POSITION                  equ 0005h
CK2PPS_TX2PPS5_SIZE                      equ 0001h
CK2PPS_TX2PPS5_LENGTH                    equ 0001h
CK2PPS_TX2PPS5_MASK                      equ 0020h

// Register: RX3PPS
#define RX3PPS RX3PPS
RX3PPS                                   equ 0E13h
// bitfield definitions
RX3PPS_PIN_POSN                          equ 0000h
RX3PPS_PIN_POSITION                      equ 0000h
RX3PPS_PIN_SIZE                          equ 0003h
RX3PPS_PIN_LENGTH                        equ 0003h
RX3PPS_PIN_MASK                          equ 0007h
RX3PPS_PORT_POSN                         equ 0003h
RX3PPS_PORT_POSITION                     equ 0003h
RX3PPS_PORT_SIZE                         equ 0003h
RX3PPS_PORT_LENGTH                       equ 0003h
RX3PPS_PORT_MASK                         equ 0038h
RX3PPS_RX3PPS_POSN                       equ 0000h
RX3PPS_RX3PPS_POSITION                   equ 0000h
RX3PPS_RX3PPS_SIZE                       equ 0006h
RX3PPS_RX3PPS_LENGTH                     equ 0006h
RX3PPS_RX3PPS_MASK                       equ 003Fh
RX3PPS_RX3PPS0_POSN                      equ 0000h
RX3PPS_RX3PPS0_POSITION                  equ 0000h
RX3PPS_RX3PPS0_SIZE                      equ 0001h
RX3PPS_RX3PPS0_LENGTH                    equ 0001h
RX3PPS_RX3PPS0_MASK                      equ 0001h
RX3PPS_RX3PPS1_POSN                      equ 0001h
RX3PPS_RX3PPS1_POSITION                  equ 0001h
RX3PPS_RX3PPS1_SIZE                      equ 0001h
RX3PPS_RX3PPS1_LENGTH                    equ 0001h
RX3PPS_RX3PPS1_MASK                      equ 0002h
RX3PPS_RX3PPS2_POSN                      equ 0002h
RX3PPS_RX3PPS2_POSITION                  equ 0002h
RX3PPS_RX3PPS2_SIZE                      equ 0001h
RX3PPS_RX3PPS2_LENGTH                    equ 0001h
RX3PPS_RX3PPS2_MASK                      equ 0004h
RX3PPS_RX3PPS3_POSN                      equ 0003h
RX3PPS_RX3PPS3_POSITION                  equ 0003h
RX3PPS_RX3PPS3_SIZE                      equ 0001h
RX3PPS_RX3PPS3_LENGTH                    equ 0001h
RX3PPS_RX3PPS3_MASK                      equ 0008h
RX3PPS_RX3PPS4_POSN                      equ 0004h
RX3PPS_RX3PPS4_POSITION                  equ 0004h
RX3PPS_RX3PPS4_SIZE                      equ 0001h
RX3PPS_RX3PPS4_LENGTH                    equ 0001h
RX3PPS_RX3PPS4_MASK                      equ 0010h
RX3PPS_RX3PPS5_POSN                      equ 0005h
RX3PPS_RX3PPS5_POSITION                  equ 0005h
RX3PPS_RX3PPS5_SIZE                      equ 0001h
RX3PPS_RX3PPS5_LENGTH                    equ 0001h
RX3PPS_RX3PPS5_MASK                      equ 0020h

// Register: CK3PPS
#define CK3PPS CK3PPS
CK3PPS                                   equ 0E14h
// bitfield definitions
CK3PPS_PIN_POSN                          equ 0000h
CK3PPS_PIN_POSITION                      equ 0000h
CK3PPS_PIN_SIZE                          equ 0003h
CK3PPS_PIN_LENGTH                        equ 0003h
CK3PPS_PIN_MASK                          equ 0007h
CK3PPS_PORT_POSN                         equ 0003h
CK3PPS_PORT_POSITION                     equ 0003h
CK3PPS_PORT_SIZE                         equ 0003h
CK3PPS_PORT_LENGTH                       equ 0003h
CK3PPS_PORT_MASK                         equ 0038h
CK3PPS_TX3PPS_POSN                       equ 0000h
CK3PPS_TX3PPS_POSITION                   equ 0000h
CK3PPS_TX3PPS_SIZE                       equ 0006h
CK3PPS_TX3PPS_LENGTH                     equ 0006h
CK3PPS_TX3PPS_MASK                       equ 003Fh
CK3PPS_TX3PPS0_POSN                      equ 0000h
CK3PPS_TX3PPS0_POSITION                  equ 0000h
CK3PPS_TX3PPS0_SIZE                      equ 0001h
CK3PPS_TX3PPS0_LENGTH                    equ 0001h
CK3PPS_TX3PPS0_MASK                      equ 0001h
CK3PPS_TX3PPS1_POSN                      equ 0001h
CK3PPS_TX3PPS1_POSITION                  equ 0001h
CK3PPS_TX3PPS1_SIZE                      equ 0001h
CK3PPS_TX3PPS1_LENGTH                    equ 0001h
CK3PPS_TX3PPS1_MASK                      equ 0002h
CK3PPS_TX3PPS2_POSN                      equ 0002h
CK3PPS_TX3PPS2_POSITION                  equ 0002h
CK3PPS_TX3PPS2_SIZE                      equ 0001h
CK3PPS_TX3PPS2_LENGTH                    equ 0001h
CK3PPS_TX3PPS2_MASK                      equ 0004h
CK3PPS_TX3PPS3_POSN                      equ 0003h
CK3PPS_TX3PPS3_POSITION                  equ 0003h
CK3PPS_TX3PPS3_SIZE                      equ 0001h
CK3PPS_TX3PPS3_LENGTH                    equ 0001h
CK3PPS_TX3PPS3_MASK                      equ 0008h
CK3PPS_TX3PPS4_POSN                      equ 0004h
CK3PPS_TX3PPS4_POSITION                  equ 0004h
CK3PPS_TX3PPS4_SIZE                      equ 0001h
CK3PPS_TX3PPS4_LENGTH                    equ 0001h
CK3PPS_TX3PPS4_MASK                      equ 0010h
CK3PPS_TX3PPS5_POSN                      equ 0005h
CK3PPS_TX3PPS5_POSITION                  equ 0005h
CK3PPS_TX3PPS5_SIZE                      equ 0001h
CK3PPS_TX3PPS5_LENGTH                    equ 0001h
CK3PPS_TX3PPS5_MASK                      equ 0020h

// Register: RX4PPS
#define RX4PPS RX4PPS
RX4PPS                                   equ 0E15h
// bitfield definitions
RX4PPS_PIN_POSN                          equ 0000h
RX4PPS_PIN_POSITION                      equ 0000h
RX4PPS_PIN_SIZE                          equ 0003h
RX4PPS_PIN_LENGTH                        equ 0003h
RX4PPS_PIN_MASK                          equ 0007h
RX4PPS_PORT_POSN                         equ 0003h
RX4PPS_PORT_POSITION                     equ 0003h
RX4PPS_PORT_SIZE                         equ 0002h
RX4PPS_PORT_LENGTH                       equ 0002h
RX4PPS_PORT_MASK                         equ 0018h
RX4PPS_RX4PPS_POSN                       equ 0000h
RX4PPS_RX4PPS_POSITION                   equ 0000h
RX4PPS_RX4PPS_SIZE                       equ 0006h
RX4PPS_RX4PPS_LENGTH                     equ 0006h
RX4PPS_RX4PPS_MASK                       equ 003Fh
RX4PPS_RX4PPS0_POSN                      equ 0000h
RX4PPS_RX4PPS0_POSITION                  equ 0000h
RX4PPS_RX4PPS0_SIZE                      equ 0001h
RX4PPS_RX4PPS0_LENGTH                    equ 0001h
RX4PPS_RX4PPS0_MASK                      equ 0001h
RX4PPS_RX4PPS1_POSN                      equ 0001h
RX4PPS_RX4PPS1_POSITION                  equ 0001h
RX4PPS_RX4PPS1_SIZE                      equ 0001h
RX4PPS_RX4PPS1_LENGTH                    equ 0001h
RX4PPS_RX4PPS1_MASK                      equ 0002h
RX4PPS_RX4PPS2_POSN                      equ 0002h
RX4PPS_RX4PPS2_POSITION                  equ 0002h
RX4PPS_RX4PPS2_SIZE                      equ 0001h
RX4PPS_RX4PPS2_LENGTH                    equ 0001h
RX4PPS_RX4PPS2_MASK                      equ 0004h
RX4PPS_RX4PPS3_POSN                      equ 0003h
RX4PPS_RX4PPS3_POSITION                  equ 0003h
RX4PPS_RX4PPS3_SIZE                      equ 0001h
RX4PPS_RX4PPS3_LENGTH                    equ 0001h
RX4PPS_RX4PPS3_MASK                      equ 0008h
RX4PPS_RX4PPS4_POSN                      equ 0004h
RX4PPS_RX4PPS4_POSITION                  equ 0004h
RX4PPS_RX4PPS4_SIZE                      equ 0001h
RX4PPS_RX4PPS4_LENGTH                    equ 0001h
RX4PPS_RX4PPS4_MASK                      equ 0010h

// Register: CK4PPS
#define CK4PPS CK4PPS
CK4PPS                                   equ 0E16h
// bitfield definitions
CK4PPS_PIN_POSN                          equ 0000h
CK4PPS_PIN_POSITION                      equ 0000h
CK4PPS_PIN_SIZE                          equ 0003h
CK4PPS_PIN_LENGTH                        equ 0003h
CK4PPS_PIN_MASK                          equ 0007h
CK4PPS_PORT_POSN                         equ 0003h
CK4PPS_PORT_POSITION                     equ 0003h
CK4PPS_PORT_SIZE                         equ 0002h
CK4PPS_PORT_LENGTH                       equ 0002h
CK4PPS_PORT_MASK                         equ 0018h
CK4PPS_TX4PPS_POSN                       equ 0000h
CK4PPS_TX4PPS_POSITION                   equ 0000h
CK4PPS_TX4PPS_SIZE                       equ 0006h
CK4PPS_TX4PPS_LENGTH                     equ 0006h
CK4PPS_TX4PPS_MASK                       equ 003Fh
CK4PPS_TX4PPS0_POSN                      equ 0000h
CK4PPS_TX4PPS0_POSITION                  equ 0000h
CK4PPS_TX4PPS0_SIZE                      equ 0001h
CK4PPS_TX4PPS0_LENGTH                    equ 0001h
CK4PPS_TX4PPS0_MASK                      equ 0001h
CK4PPS_TX4PPS1_POSN                      equ 0001h
CK4PPS_TX4PPS1_POSITION                  equ 0001h
CK4PPS_TX4PPS1_SIZE                      equ 0001h
CK4PPS_TX4PPS1_LENGTH                    equ 0001h
CK4PPS_TX4PPS1_MASK                      equ 0002h
CK4PPS_TX4PPS2_POSN                      equ 0002h
CK4PPS_TX4PPS2_POSITION                  equ 0002h
CK4PPS_TX4PPS2_SIZE                      equ 0001h
CK4PPS_TX4PPS2_LENGTH                    equ 0001h
CK4PPS_TX4PPS2_MASK                      equ 0004h
CK4PPS_TX4PPS3_POSN                      equ 0003h
CK4PPS_TX4PPS3_POSITION                  equ 0003h
CK4PPS_TX4PPS3_SIZE                      equ 0001h
CK4PPS_TX4PPS3_LENGTH                    equ 0001h
CK4PPS_TX4PPS3_MASK                      equ 0008h
CK4PPS_TX4PPS4_POSN                      equ 0004h
CK4PPS_TX4PPS4_POSITION                  equ 0004h
CK4PPS_TX4PPS4_SIZE                      equ 0001h
CK4PPS_TX4PPS4_LENGTH                    equ 0001h
CK4PPS_TX4PPS4_MASK                      equ 0010h

// Register: RX5PPS
#define RX5PPS RX5PPS
RX5PPS                                   equ 0E17h
// bitfield definitions
RX5PPS_PIN_POSN                          equ 0000h
RX5PPS_PIN_POSITION                      equ 0000h
RX5PPS_PIN_SIZE                          equ 0003h
RX5PPS_PIN_LENGTH                        equ 0003h
RX5PPS_PIN_MASK                          equ 0007h
RX5PPS_PORT_POSN                         equ 0003h
RX5PPS_PORT_POSITION                     equ 0003h
RX5PPS_PORT_SIZE                         equ 0003h
RX5PPS_PORT_LENGTH                       equ 0003h
RX5PPS_PORT_MASK                         equ 0038h
RX5PPS_RX5PPS_POSN                       equ 0000h
RX5PPS_RX5PPS_POSITION                   equ 0000h
RX5PPS_RX5PPS_SIZE                       equ 0006h
RX5PPS_RX5PPS_LENGTH                     equ 0006h
RX5PPS_RX5PPS_MASK                       equ 003Fh
RX5PPS_RX5PPS0_POSN                      equ 0000h
RX5PPS_RX5PPS0_POSITION                  equ 0000h
RX5PPS_RX5PPS0_SIZE                      equ 0001h
RX5PPS_RX5PPS0_LENGTH                    equ 0001h
RX5PPS_RX5PPS0_MASK                      equ 0001h
RX5PPS_RX5PPS1_POSN                      equ 0001h
RX5PPS_RX5PPS1_POSITION                  equ 0001h
RX5PPS_RX5PPS1_SIZE                      equ 0001h
RX5PPS_RX5PPS1_LENGTH                    equ 0001h
RX5PPS_RX5PPS1_MASK                      equ 0002h
RX5PPS_RX5PPS2_POSN                      equ 0002h
RX5PPS_RX5PPS2_POSITION                  equ 0002h
RX5PPS_RX5PPS2_SIZE                      equ 0001h
RX5PPS_RX5PPS2_LENGTH                    equ 0001h
RX5PPS_RX5PPS2_MASK                      equ 0004h
RX5PPS_RX5PPS3_POSN                      equ 0003h
RX5PPS_RX5PPS3_POSITION                  equ 0003h
RX5PPS_RX5PPS3_SIZE                      equ 0001h
RX5PPS_RX5PPS3_LENGTH                    equ 0001h
RX5PPS_RX5PPS3_MASK                      equ 0008h
RX5PPS_RX5PPS4_POSN                      equ 0004h
RX5PPS_RX5PPS4_POSITION                  equ 0004h
RX5PPS_RX5PPS4_SIZE                      equ 0001h
RX5PPS_RX5PPS4_LENGTH                    equ 0001h
RX5PPS_RX5PPS4_MASK                      equ 0010h
RX5PPS_RX5PPS5_POSN                      equ 0005h
RX5PPS_RX5PPS5_POSITION                  equ 0005h
RX5PPS_RX5PPS5_SIZE                      equ 0001h
RX5PPS_RX5PPS5_LENGTH                    equ 0001h
RX5PPS_RX5PPS5_MASK                      equ 0020h

// Register: CK5PPS
#define CK5PPS CK5PPS
CK5PPS                                   equ 0E18h
// bitfield definitions
CK5PPS_PIN_POSN                          equ 0000h
CK5PPS_PIN_POSITION                      equ 0000h
CK5PPS_PIN_SIZE                          equ 0003h
CK5PPS_PIN_LENGTH                        equ 0003h
CK5PPS_PIN_MASK                          equ 0007h
CK5PPS_PORT_POSN                         equ 0003h
CK5PPS_PORT_POSITION                     equ 0003h
CK5PPS_PORT_SIZE                         equ 0003h
CK5PPS_PORT_LENGTH                       equ 0003h
CK5PPS_PORT_MASK                         equ 0038h
CK5PPS_TX5PPS_POSN                       equ 0000h
CK5PPS_TX5PPS_POSITION                   equ 0000h
CK5PPS_TX5PPS_SIZE                       equ 0006h
CK5PPS_TX5PPS_LENGTH                     equ 0006h
CK5PPS_TX5PPS_MASK                       equ 003Fh
CK5PPS_TX5PPS0_POSN                      equ 0000h
CK5PPS_TX5PPS0_POSITION                  equ 0000h
CK5PPS_TX5PPS0_SIZE                      equ 0001h
CK5PPS_TX5PPS0_LENGTH                    equ 0001h
CK5PPS_TX5PPS0_MASK                      equ 0001h
CK5PPS_TX5PPS1_POSN                      equ 0001h
CK5PPS_TX5PPS1_POSITION                  equ 0001h
CK5PPS_TX5PPS1_SIZE                      equ 0001h
CK5PPS_TX5PPS1_LENGTH                    equ 0001h
CK5PPS_TX5PPS1_MASK                      equ 0002h
CK5PPS_TX5PPS2_POSN                      equ 0002h
CK5PPS_TX5PPS2_POSITION                  equ 0002h
CK5PPS_TX5PPS2_SIZE                      equ 0001h
CK5PPS_TX5PPS2_LENGTH                    equ 0001h
CK5PPS_TX5PPS2_MASK                      equ 0004h
CK5PPS_TX5PPS3_POSN                      equ 0003h
CK5PPS_TX5PPS3_POSITION                  equ 0003h
CK5PPS_TX5PPS3_SIZE                      equ 0001h
CK5PPS_TX5PPS3_LENGTH                    equ 0001h
CK5PPS_TX5PPS3_MASK                      equ 0008h
CK5PPS_TX5PPS4_POSN                      equ 0004h
CK5PPS_TX5PPS4_POSITION                  equ 0004h
CK5PPS_TX5PPS4_SIZE                      equ 0001h
CK5PPS_TX5PPS4_LENGTH                    equ 0001h
CK5PPS_TX5PPS4_MASK                      equ 0010h
CK5PPS_TX5PPS5_POSN                      equ 0005h
CK5PPS_TX5PPS5_POSITION                  equ 0005h
CK5PPS_TX5PPS5_SIZE                      equ 0001h
CK5PPS_TX5PPS5_LENGTH                    equ 0001h
CK5PPS_TX5PPS5_MASK                      equ 0020h

