GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
// Register: CM3CON0
#define CM3CON0 CM3CON0
CM3CON0                                  equ 0EC8h
// bitfield definitions
CM3CON0_SYNC_POSN                        equ 0000h
CM3CON0_SYNC_POSITION                    equ 0000h
CM3CON0_SYNC_SIZE                        equ 0001h
CM3CON0_SYNC_LENGTH                      equ 0001h
CM3CON0_SYNC_MASK                        equ 0001h
CM3CON0_HYS_POSN                         equ 0001h
CM3CON0_HYS_POSITION                     equ 0001h
CM3CON0_HYS_SIZE                         equ 0001h
CM3CON0_HYS_LENGTH                       equ 0001h
CM3CON0_HYS_MASK                         equ 0002h
CM3CON0_POL_POSN                         equ 0004h
CM3CON0_POL_POSITION                     equ 0004h
CM3CON0_POL_SIZE                         equ 0001h
CM3CON0_POL_LENGTH                       equ 0001h
CM3CON0_POL_MASK                         equ 0010h
CM3CON0_OUT_POSN                         equ 0006h
CM3CON0_OUT_POSITION                     equ 0006h
CM3CON0_OUT_SIZE                         equ 0001h
CM3CON0_OUT_LENGTH                       equ 0001h
CM3CON0_OUT_MASK                         equ 0040h
CM3CON0_EN_POSN                          equ 0007h
CM3CON0_EN_POSITION                      equ 0007h
CM3CON0_EN_SIZE                          equ 0001h
CM3CON0_EN_LENGTH                        equ 0001h
CM3CON0_EN_MASK                          equ 0080h
CM3CON0_C3SYNC_POSN                      equ 0000h
CM3CON0_C3SYNC_POSITION                  equ 0000h
CM3CON0_C3SYNC_SIZE                      equ 0001h
CM3CON0_C3SYNC_LENGTH                    equ 0001h
CM3CON0_C3SYNC_MASK                      equ 0001h
CM3CON0_C3HYS_POSN                       equ 0001h
CM3CON0_C3HYS_POSITION                   equ 0001h
CM3CON0_C3HYS_SIZE                       equ 0001h
CM3CON0_C3HYS_LENGTH                     equ 0001h
CM3CON0_C3HYS_MASK                       equ 0002h
CM3CON0_C3POL_POSN                       equ 0004h
CM3CON0_C3POL_POSITION                   equ 0004h
CM3CON0_C3POL_SIZE                       equ 0001h
CM3CON0_C3POL_LENGTH                     equ 0001h
CM3CON0_C3POL_MASK                       equ 0010h
CM3CON0_C3OUT_POSN                       equ 0006h
CM3CON0_C3OUT_POSITION                   equ 0006h
CM3CON0_C3OUT_SIZE                       equ 0001h
CM3CON0_C3OUT_LENGTH                     equ 0001h
CM3CON0_C3OUT_MASK                       equ 0040h
CM3CON0_C3EN_POSN                        equ 0007h
CM3CON0_C3EN_POSITION                    equ 0007h
CM3CON0_C3EN_SIZE                        equ 0001h
CM3CON0_C3EN_LENGTH                      equ 0001h
CM3CON0_C3EN_MASK                        equ 0080h

// Register: CM3CON1
#define CM3CON1 CM3CON1
CM3CON1                                  equ 0EC9h
// bitfield definitions
CM3CON1_INTN_POSN                        equ 0000h
CM3CON1_INTN_POSITION                    equ 0000h
CM3CON1_INTN_SIZE                        equ 0001h
CM3CON1_INTN_LENGTH                      equ 0001h
CM3CON1_INTN_MASK                        equ 0001h
CM3CON1_INTP_POSN                        equ 0001h
CM3CON1_INTP_POSITION                    equ 0001h
CM3CON1_INTP_SIZE                        equ 0001h
CM3CON1_INTP_LENGTH                      equ 0001h
CM3CON1_INTP_MASK                        equ 0002h
CM3CON1_C3INTN_POSN                      equ 0000h
CM3CON1_C3INTN_POSITION                  equ 0000h
CM3CON1_C3INTN_SIZE                      equ 0001h
CM3CON1_C3INTN_LENGTH                    equ 0001h
CM3CON1_C3INTN_MASK                      equ 0001h
CM3CON1_C3INTP_POSN                      equ 0001h
CM3CON1_C3INTP_POSITION                  equ 0001h
CM3CON1_C3INTP_SIZE                      equ 0001h
CM3CON1_C3INTP_LENGTH                    equ 0001h
CM3CON1_C3INTP_MASK                      equ 0002h

// Register: CM3NCH
#define CM3NCH CM3NCH
CM3NCH                                   equ 0ECAh
// bitfield definitions
CM3NCH_NCH_POSN                          equ 0000h
CM3NCH_NCH_POSITION                      equ 0000h
CM3NCH_NCH_SIZE                          equ 0003h
CM3NCH_NCH_LENGTH                        equ 0003h
CM3NCH_NCH_MASK                          equ 0007h
CM3NCH_NCH0_POSN                         equ 0000h
CM3NCH_NCH0_POSITION                     equ 0000h
CM3NCH_NCH0_SIZE                         equ 0001h
CM3NCH_NCH0_LENGTH                       equ 0001h
CM3NCH_NCH0_MASK                         equ 0001h
CM3NCH_NCH1_POSN                         equ 0001h
CM3NCH_NCH1_POSITION                     equ 0001h
CM3NCH_NCH1_SIZE                         equ 0001h
CM3NCH_NCH1_LENGTH                       equ 0001h
CM3NCH_NCH1_MASK                         equ 0002h
CM3NCH_NCH2_POSN                         equ 0002h
CM3NCH_NCH2_POSITION                     equ 0002h
CM3NCH_NCH2_SIZE                         equ 0001h
CM3NCH_NCH2_LENGTH                       equ 0001h
CM3NCH_NCH2_MASK                         equ 0004h
CM3NCH_C3NCH0_POSN                       equ 0000h
CM3NCH_C3NCH0_POSITION                   equ 0000h
CM3NCH_C3NCH0_SIZE                       equ 0001h
CM3NCH_C3NCH0_LENGTH                     equ 0001h
CM3NCH_C3NCH0_MASK                       equ 0001h
CM3NCH_C3NCH1_POSN                       equ 0001h
CM3NCH_C3NCH1_POSITION                   equ 0001h
CM3NCH_C3NCH1_SIZE                       equ 0001h
CM3NCH_C3NCH1_LENGTH                     equ 0001h
CM3NCH_C3NCH1_MASK                       equ 0002h
CM3NCH_C3NCH2_POSN                       equ 0002h
CM3NCH_C3NCH2_POSITION                   equ 0002h
CM3NCH_C3NCH2_SIZE                       equ 0001h
CM3NCH_C3NCH2_LENGTH                     equ 0001h
CM3NCH_C3NCH2_MASK                       equ 0004h

// Register: CM3PCH
#define CM3PCH CM3PCH
CM3PCH                                   equ 0ECBh
// bitfield definitions
CM3PCH_PCH_POSN                          equ 0000h
CM3PCH_PCH_POSITION                      equ 0000h
CM3PCH_PCH_SIZE                          equ 0003h
CM3PCH_PCH_LENGTH                        equ 0003h
CM3PCH_PCH_MASK                          equ 0007h
CM3PCH_PCH0_POSN                         equ 0000h
CM3PCH_PCH0_POSITION                     equ 0000h
CM3PCH_PCH0_SIZE                         equ 0001h
CM3PCH_PCH0_LENGTH                       equ 0001h
CM3PCH_PCH0_MASK                         equ 0001h
CM3PCH_PCH1_POSN                         equ 0001h
CM3PCH_PCH1_POSITION                     equ 0001h
CM3PCH_PCH1_SIZE                         equ 0001h
CM3PCH_PCH1_LENGTH                       equ 0001h
CM3PCH_PCH1_MASK                         equ 0002h
CM3PCH_PCH2_POSN                         equ 0002h
CM3PCH_PCH2_POSITION                     equ 0002h
CM3PCH_PCH2_SIZE                         equ 0001h
CM3PCH_PCH2_LENGTH                       equ 0001h
CM3PCH_PCH2_MASK                         equ 0004h
CM3PCH_C3PCH0_POSN                       equ 0000h
CM3PCH_C3PCH0_POSITION                   equ 0000h
CM3PCH_C3PCH0_SIZE                       equ 0001h
CM3PCH_C3PCH0_LENGTH                     equ 0001h
CM3PCH_C3PCH0_MASK                       equ 0001h
CM3PCH_C3PCH1_POSN                       equ 0001h
CM3PCH_C3PCH1_POSITION                   equ 0001h
CM3PCH_C3PCH1_SIZE                       equ 0001h
CM3PCH_C3PCH1_LENGTH                     equ 0001h
CM3PCH_C3PCH1_MASK                       equ 0002h
CM3PCH_C3PCH2_POSN                       equ 0002h
CM3PCH_C3PCH2_POSITION                   equ 0002h
CM3PCH_C3PCH2_SIZE                       equ 0001h
CM3PCH_C3PCH2_LENGTH                     equ 0001h
CM3PCH_C3PCH2_MASK                       equ 0004h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0ECCh
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_EN_POSN                          equ 0007h
CM2CON0_EN_POSITION                      equ 0007h
CM2CON0_EN_SIZE                          equ 0001h
CM2CON0_EN_LENGTH                        equ 0001h
CM2CON0_EN_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2EN_POSN                        equ 0007h
CM2CON0_C2EN_POSITION                    equ 0007h
CM2CON0_C2EN_SIZE                        equ 0001h
CM2CON0_C2EN_LENGTH                      equ 0001h
CM2CON0_C2EN_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0ECDh
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NCH
#define CM2NCH CM2NCH
CM2NCH                                   equ 0ECEh
// bitfield definitions
CM2NCH_NCH_POSN                          equ 0000h
CM2NCH_NCH_POSITION                      equ 0000h
CM2NCH_NCH_SIZE                          equ 0003h
CM2NCH_NCH_LENGTH                        equ 0003h
CM2NCH_NCH_MASK                          equ 0007h
CM2NCH_NCH0_POSN                         equ 0000h
CM2NCH_NCH0_POSITION                     equ 0000h
CM2NCH_NCH0_SIZE                         equ 0001h
CM2NCH_NCH0_LENGTH                       equ 0001h
CM2NCH_NCH0_MASK                         equ 0001h
CM2NCH_NCH1_POSN                         equ 0001h
CM2NCH_NCH1_POSITION                     equ 0001h
CM2NCH_NCH1_SIZE                         equ 0001h
CM2NCH_NCH1_LENGTH                       equ 0001h
CM2NCH_NCH1_MASK                         equ 0002h
CM2NCH_NCH2_POSN                         equ 0002h
CM2NCH_NCH2_POSITION                     equ 0002h
CM2NCH_NCH2_SIZE                         equ 0001h
CM2NCH_NCH2_LENGTH                       equ 0001h
CM2NCH_NCH2_MASK                         equ 0004h
CM2NCH_C2NCH0_POSN                       equ 0000h
CM2NCH_C2NCH0_POSITION                   equ 0000h
CM2NCH_C2NCH0_SIZE                       equ 0001h
CM2NCH_C2NCH0_LENGTH                     equ 0001h
CM2NCH_C2NCH0_MASK                       equ 0001h
CM2NCH_C2NCH1_POSN                       equ 0001h
CM2NCH_C2NCH1_POSITION                   equ 0001h
CM2NCH_C2NCH1_SIZE                       equ 0001h
CM2NCH_C2NCH1_LENGTH                     equ 0001h
CM2NCH_C2NCH1_MASK                       equ 0002h
CM2NCH_C2NCH2_POSN                       equ 0002h
CM2NCH_C2NCH2_POSITION                   equ 0002h
CM2NCH_C2NCH2_SIZE                       equ 0001h
CM2NCH_C2NCH2_LENGTH                     equ 0001h
CM2NCH_C2NCH2_MASK                       equ 0004h

