GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
// Register: TMR7H
#define TMR7H TMR7H
TMR7H                                    equ 0F2Fh
// bitfield definitions
TMR7H_TMR7H0_POSN                        equ 0000h
TMR7H_TMR7H0_POSITION                    equ 0000h
TMR7H_TMR7H0_SIZE                        equ 0001h
TMR7H_TMR7H0_LENGTH                      equ 0001h
TMR7H_TMR7H0_MASK                        equ 0001h
TMR7H_TMR7H1_POSN                        equ 0001h
TMR7H_TMR7H1_POSITION                    equ 0001h
TMR7H_TMR7H1_SIZE                        equ 0001h
TMR7H_TMR7H1_LENGTH                      equ 0001h
TMR7H_TMR7H1_MASK                        equ 0002h
TMR7H_TMR7H2_POSN                        equ 0002h
TMR7H_TMR7H2_POSITION                    equ 0002h
TMR7H_TMR7H2_SIZE                        equ 0001h
TMR7H_TMR7H2_LENGTH                      equ 0001h
TMR7H_TMR7H2_MASK                        equ 0004h
TMR7H_TMR7H3_POSN                        equ 0003h
TMR7H_TMR7H3_POSITION                    equ 0003h
TMR7H_TMR7H3_SIZE                        equ 0001h
TMR7H_TMR7H3_LENGTH                      equ 0001h
TMR7H_TMR7H3_MASK                        equ 0008h
TMR7H_TMR7H4_POSN                        equ 0004h
TMR7H_TMR7H4_POSITION                    equ 0004h
TMR7H_TMR7H4_SIZE                        equ 0001h
TMR7H_TMR7H4_LENGTH                      equ 0001h
TMR7H_TMR7H4_MASK                        equ 0010h
TMR7H_TMR7H5_POSN                        equ 0005h
TMR7H_TMR7H5_POSITION                    equ 0005h
TMR7H_TMR7H5_SIZE                        equ 0001h
TMR7H_TMR7H5_LENGTH                      equ 0001h
TMR7H_TMR7H5_MASK                        equ 0020h
TMR7H_TMR7H6_POSN                        equ 0006h
TMR7H_TMR7H6_POSITION                    equ 0006h
TMR7H_TMR7H6_SIZE                        equ 0001h
TMR7H_TMR7H6_LENGTH                      equ 0001h
TMR7H_TMR7H6_MASK                        equ 0040h
TMR7H_TMR7H7_POSN                        equ 0007h
TMR7H_TMR7H7_POSITION                    equ 0007h
TMR7H_TMR7H7_SIZE                        equ 0001h
TMR7H_TMR7H7_LENGTH                      equ 0001h
TMR7H_TMR7H7_MASK                        equ 0080h
TMR7H_TMR7H_POSN                         equ 0000h
TMR7H_TMR7H_POSITION                     equ 0000h
TMR7H_TMR7H_SIZE                         equ 0008h
TMR7H_TMR7H_LENGTH                       equ 0008h
TMR7H_TMR7H_MASK                         equ 00FFh
TMR7H_TMR78_POSN                         equ 0000h
TMR7H_TMR78_POSITION                     equ 0000h
TMR7H_TMR78_SIZE                         equ 0001h
TMR7H_TMR78_LENGTH                       equ 0001h
TMR7H_TMR78_MASK                         equ 0001h
TMR7H_TMR79_POSN                         equ 0001h
TMR7H_TMR79_POSITION                     equ 0001h
TMR7H_TMR79_SIZE                         equ 0001h
TMR7H_TMR79_LENGTH                       equ 0001h
TMR7H_TMR79_MASK                         equ 0002h
TMR7H_TMR710_POSN                        equ 0002h
TMR7H_TMR710_POSITION                    equ 0002h
TMR7H_TMR710_SIZE                        equ 0001h
TMR7H_TMR710_LENGTH                      equ 0001h
TMR7H_TMR710_MASK                        equ 0004h
TMR7H_TMR711_POSN                        equ 0003h
TMR7H_TMR711_POSITION                    equ 0003h
TMR7H_TMR711_SIZE                        equ 0001h
TMR7H_TMR711_LENGTH                      equ 0001h
TMR7H_TMR711_MASK                        equ 0008h
TMR7H_TMR712_POSN                        equ 0004h
TMR7H_TMR712_POSITION                    equ 0004h
TMR7H_TMR712_SIZE                        equ 0001h
TMR7H_TMR712_LENGTH                      equ 0001h
TMR7H_TMR712_MASK                        equ 0010h
TMR7H_TMR713_POSN                        equ 0005h
TMR7H_TMR713_POSITION                    equ 0005h
TMR7H_TMR713_SIZE                        equ 0001h
TMR7H_TMR713_LENGTH                      equ 0001h
TMR7H_TMR713_MASK                        equ 0020h
TMR7H_TMR714_POSN                        equ 0006h
TMR7H_TMR714_POSITION                    equ 0006h
TMR7H_TMR714_SIZE                        equ 0001h
TMR7H_TMR714_LENGTH                      equ 0001h
TMR7H_TMR714_MASK                        equ 0040h
TMR7H_TMR715_POSN                        equ 0007h
TMR7H_TMR715_POSITION                    equ 0007h
TMR7H_TMR715_SIZE                        equ 0001h
TMR7H_TMR715_LENGTH                      equ 0001h
TMR7H_TMR715_MASK                        equ 0080h

// Register: T7CON
#define T7CON T7CON
T7CON                                    equ 0F30h
// bitfield definitions
T7CON_NOT_SYNC_POSN                      equ 0002h
T7CON_NOT_SYNC_POSITION                  equ 0002h
T7CON_NOT_SYNC_SIZE                      equ 0001h
T7CON_NOT_SYNC_LENGTH                    equ 0001h
T7CON_NOT_SYNC_MASK                      equ 0004h
T7CON_ON_POSN                            equ 0000h
T7CON_ON_POSITION                        equ 0000h
T7CON_ON_SIZE                            equ 0001h
T7CON_ON_LENGTH                          equ 0001h
T7CON_ON_MASK                            equ 0001h
T7CON_RD16_POSN                          equ 0001h
T7CON_RD16_POSITION                      equ 0001h
T7CON_RD16_SIZE                          equ 0001h
T7CON_RD16_LENGTH                        equ 0001h
T7CON_RD16_MASK                          equ 0002h
T7CON_nSYNC_POSN                         equ 0002h
T7CON_nSYNC_POSITION                     equ 0002h
T7CON_nSYNC_SIZE                         equ 0001h
T7CON_nSYNC_LENGTH                       equ 0001h
T7CON_nSYNC_MASK                         equ 0004h
T7CON_CKPS_POSN                          equ 0004h
T7CON_CKPS_POSITION                      equ 0004h
T7CON_CKPS_SIZE                          equ 0002h
T7CON_CKPS_LENGTH                        equ 0002h
T7CON_CKPS_MASK                          equ 0030h
T7CON_NOT_T7SYNC_POSN                    equ 0002h
T7CON_NOT_T7SYNC_POSITION                equ 0002h
T7CON_NOT_T7SYNC_SIZE                    equ 0001h
T7CON_NOT_T7SYNC_LENGTH                  equ 0001h
T7CON_NOT_T7SYNC_MASK                    equ 0004h
T7CON_TMR7ON_POSN                        equ 0000h
T7CON_TMR7ON_POSITION                    equ 0000h
T7CON_TMR7ON_SIZE                        equ 0001h
T7CON_TMR7ON_LENGTH                      equ 0001h
T7CON_TMR7ON_MASK                        equ 0001h
T7CON_T7RD16_POSN                        equ 0001h
T7CON_T7RD16_POSITION                    equ 0001h
T7CON_T7RD16_SIZE                        equ 0001h
T7CON_T7RD16_LENGTH                      equ 0001h
T7CON_T7RD16_MASK                        equ 0002h
T7CON_nT7SYNC_POSN                       equ 0002h
T7CON_nT7SYNC_POSITION                   equ 0002h
T7CON_nT7SYNC_SIZE                       equ 0001h
T7CON_nT7SYNC_LENGTH                     equ 0001h
T7CON_nT7SYNC_MASK                       equ 0004h
T7CON_T7CKPS0_POSN                       equ 0004h
T7CON_T7CKPS0_POSITION                   equ 0004h
T7CON_T7CKPS0_SIZE                       equ 0001h
T7CON_T7CKPS0_LENGTH                     equ 0001h
T7CON_T7CKPS0_MASK                       equ 0010h
T7CON_T7CKPS1_POSN                       equ 0005h
T7CON_T7CKPS1_POSITION                   equ 0005h
T7CON_T7CKPS1_SIZE                       equ 0001h
T7CON_T7CKPS1_LENGTH                     equ 0001h
T7CON_T7CKPS1_MASK                       equ 0020h
T7CON_CKPS0_POSN                         equ 0004h
T7CON_CKPS0_POSITION                     equ 0004h
T7CON_CKPS0_SIZE                         equ 0001h
T7CON_CKPS0_LENGTH                       equ 0001h
T7CON_CKPS0_MASK                         equ 0010h
T7CON_CKPS1_POSN                         equ 0005h
T7CON_CKPS1_POSITION                     equ 0005h
T7CON_CKPS1_SIZE                         equ 0001h
T7CON_CKPS1_LENGTH                       equ 0001h
T7CON_CKPS1_MASK                         equ 0020h
T7CON_RD167_POSN                         equ 0001h
T7CON_RD167_POSITION                     equ 0001h
T7CON_RD167_SIZE                         equ 0001h
T7CON_RD167_LENGTH                       equ 0001h
T7CON_RD167_MASK                         equ 0002h

// Register: T7GCON
#define T7GCON T7GCON
T7GCON                                   equ 0F31h
// bitfield definitions
T7GCON_GGO_NOT_DONE_POSN                 equ 0003h
T7GCON_GGO_NOT_DONE_POSITION             equ 0003h
T7GCON_GGO_NOT_DONE_SIZE                 equ 0001h
T7GCON_GGO_NOT_DONE_LENGTH               equ 0001h
T7GCON_GGO_NOT_DONE_MASK                 equ 0008h
T7GCON_GVAL_POSN                         equ 0002h
T7GCON_GVAL_POSITION                     equ 0002h
T7GCON_GVAL_SIZE                         equ 0001h
T7GCON_GVAL_LENGTH                       equ 0001h
T7GCON_GVAL_MASK                         equ 0004h
T7GCON_GGO_nDONE_POSN                    equ 0003h
T7GCON_GGO_nDONE_POSITION                equ 0003h
T7GCON_GGO_nDONE_SIZE                    equ 0001h
T7GCON_GGO_nDONE_LENGTH                  equ 0001h
T7GCON_GGO_nDONE_MASK                    equ 0008h
T7GCON_GSPM_POSN                         equ 0004h
T7GCON_GSPM_POSITION                     equ 0004h
T7GCON_GSPM_SIZE                         equ 0001h
T7GCON_GSPM_LENGTH                       equ 0001h
T7GCON_GSPM_MASK                         equ 0010h
T7GCON_GTM_POSN                          equ 0005h
T7GCON_GTM_POSITION                      equ 0005h
T7GCON_GTM_SIZE                          equ 0001h
T7GCON_GTM_LENGTH                        equ 0001h
T7GCON_GTM_MASK                          equ 0020h
T7GCON_GPOL_POSN                         equ 0006h
T7GCON_GPOL_POSITION                     equ 0006h
T7GCON_GPOL_SIZE                         equ 0001h
T7GCON_GPOL_LENGTH                       equ 0001h
T7GCON_GPOL_MASK                         equ 0040h
T7GCON_GE_POSN                           equ 0007h
T7GCON_GE_POSITION                       equ 0007h
T7GCON_GE_SIZE                           equ 0001h
T7GCON_GE_LENGTH                         equ 0001h
T7GCON_GE_MASK                           equ 0080h
T7GCON_T7GGO_NOT_DONE_POSN               equ 0003h
T7GCON_T7GGO_NOT_DONE_POSITION           equ 0003h
T7GCON_T7GGO_NOT_DONE_SIZE               equ 0001h
T7GCON_T7GGO_NOT_DONE_LENGTH             equ 0001h
T7GCON_T7GGO_NOT_DONE_MASK               equ 0008h
T7GCON_T7GVAL_POSN                       equ 0002h
T7GCON_T7GVAL_POSITION                   equ 0002h
T7GCON_T7GVAL_SIZE                       equ 0001h
T7GCON_T7GVAL_LENGTH                     equ 0001h
T7GCON_T7GVAL_MASK                       equ 0004h
T7GCON_T7GGO_nDONE_POSN                  equ 0003h
T7GCON_T7GGO_nDONE_POSITION              equ 0003h
T7GCON_T7GGO_nDONE_SIZE                  equ 0001h
T7GCON_T7GGO_nDONE_LENGTH                equ 0001h
T7GCON_T7GGO_nDONE_MASK                  equ 0008h
T7GCON_T7GSPM_POSN                       equ 0004h
T7GCON_T7GSPM_POSITION                   equ 0004h
T7GCON_T7GSPM_SIZE                       equ 0001h
T7GCON_T7GSPM_LENGTH                     equ 0001h
T7GCON_T7GSPM_MASK                       equ 0010h
T7GCON_T7GTM_POSN                        equ 0005h
T7GCON_T7GTM_POSITION                    equ 0005h
T7GCON_T7GTM_SIZE                        equ 0001h
T7GCON_T7GTM_LENGTH                      equ 0001h
T7GCON_T7GTM_MASK                        equ 0020h
T7GCON_T7GPOL_POSN                       equ 0006h
T7GCON_T7GPOL_POSITION                   equ 0006h
T7GCON_T7GPOL_SIZE                       equ 0001h
T7GCON_T7GPOL_LENGTH                     equ 0001h
T7GCON_T7GPOL_MASK                       equ 0040h
T7GCON_T7GE_POSN                         equ 0007h
T7GCON_T7GE_POSITION                     equ 0007h
T7GCON_T7GE_SIZE                         equ 0001h
T7GCON_T7GE_LENGTH                       equ 0001h
T7GCON_T7GE_MASK                         equ 0080h
T7GCON_T7GGO_POSN                        equ 0003h
T7GCON_T7GGO_POSITION                    equ 0003h
T7GCON_T7GGO_SIZE                        equ 0001h
T7GCON_T7GGO_LENGTH                      equ 0001h
T7GCON_T7GGO_MASK                        equ 0008h

// Register: T7GATE
#define T7GATE T7GATE
T7GATE                                   equ 0F32h
// bitfield definitions
T7GATE_GSS_POSN                          equ 0000h
T7GATE_GSS_POSITION                      equ 0000h
T7GATE_GSS_SIZE                          equ 0005h
T7GATE_GSS_LENGTH                        equ 0005h
T7GATE_GSS_MASK                          equ 001Fh
T7GATE_GSS0_POSN                         equ 0000h
T7GATE_GSS0_POSITION                     equ 0000h
T7GATE_GSS0_SIZE                         equ 0001h
T7GATE_GSS0_LENGTH                       equ 0001h
T7GATE_GSS0_MASK                         equ 0001h
T7GATE_GSS1_POSN                         equ 0001h
T7GATE_GSS1_POSITION                     equ 0001h
T7GATE_GSS1_SIZE                         equ 0001h
T7GATE_GSS1_LENGTH                       equ 0001h
T7GATE_GSS1_MASK                         equ 0002h
T7GATE_GSS2_POSN                         equ 0002h
T7GATE_GSS2_POSITION                     equ 0002h
T7GATE_GSS2_SIZE                         equ 0001h
T7GATE_GSS2_LENGTH                       equ 0001h
T7GATE_GSS2_MASK                         equ 0004h
T7GATE_GSS3_POSN                         equ 0003h
T7GATE_GSS3_POSITION                     equ 0003h
T7GATE_GSS3_SIZE                         equ 0001h
T7GATE_GSS3_LENGTH                       equ 0001h
T7GATE_GSS3_MASK                         equ 0008h
T7GATE_GSS4_POSN                         equ 0004h
T7GATE_GSS4_POSITION                     equ 0004h
T7GATE_GSS4_SIZE                         equ 0001h
T7GATE_GSS4_LENGTH                       equ 0001h
T7GATE_GSS4_MASK                         equ 0010h
T7GATE_T7GSS0_POSN                       equ 0000h
T7GATE_T7GSS0_POSITION                   equ 0000h
T7GATE_T7GSS0_SIZE                       equ 0001h
T7GATE_T7GSS0_LENGTH                     equ 0001h
T7GATE_T7GSS0_MASK                       equ 0001h
T7GATE_T7GSS1_POSN                       equ 0001h
T7GATE_T7GSS1_POSITION                   equ 0001h
T7GATE_T7GSS1_SIZE                       equ 0001h
T7GATE_T7GSS1_LENGTH                     equ 0001h
T7GATE_T7GSS1_MASK                       equ 0002h
T7GATE_T7GSS2_POSN                       equ 0002h
T7GATE_T7GSS2_POSITION                   equ 0002h
T7GATE_T7GSS2_SIZE                       equ 0001h
T7GATE_T7GSS2_LENGTH                     equ 0001h
T7GATE_T7GSS2_MASK                       equ 0004h
T7GATE_T7GSS3_POSN                       equ 0003h
T7GATE_T7GSS3_POSITION                   equ 0003h
T7GATE_T7GSS3_SIZE                       equ 0001h
T7GATE_T7GSS3_LENGTH                     equ 0001h
T7GATE_T7GSS3_MASK                       equ 0008h
T7GATE_T7GSS4_POSN                       equ 0004h
T7GATE_T7GSS4_POSITION                   equ 0004h
T7GATE_T7GSS4_SIZE                       equ 0001h
T7GATE_T7GSS4_LENGTH                     equ 0001h
T7GATE_T7GSS4_MASK                       equ 0010h

