GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
// Register: LATH
#define LATH LATH
LATH                                     equ 0F80h
// bitfield definitions
LATH_LATH0_POSN                          equ 0000h
LATH_LATH0_POSITION                      equ 0000h
LATH_LATH0_SIZE                          equ 0001h
LATH_LATH0_LENGTH                        equ 0001h
LATH_LATH0_MASK                          equ 0001h
LATH_LATH1_POSN                          equ 0001h
LATH_LATH1_POSITION                      equ 0001h
LATH_LATH1_SIZE                          equ 0001h
LATH_LATH1_LENGTH                        equ 0001h
LATH_LATH1_MASK                          equ 0002h
LATH_LATH2_POSN                          equ 0002h
LATH_LATH2_POSITION                      equ 0002h
LATH_LATH2_SIZE                          equ 0001h
LATH_LATH2_LENGTH                        equ 0001h
LATH_LATH2_MASK                          equ 0004h
LATH_LATH3_POSN                          equ 0003h
LATH_LATH3_POSITION                      equ 0003h
LATH_LATH3_SIZE                          equ 0001h
LATH_LATH3_LENGTH                        equ 0001h
LATH_LATH3_MASK                          equ 0008h
LATH_LH0_POSN                            equ 0000h
LATH_LH0_POSITION                        equ 0000h
LATH_LH0_SIZE                            equ 0001h
LATH_LH0_LENGTH                          equ 0001h
LATH_LH0_MASK                            equ 0001h
LATH_LH1_POSN                            equ 0001h
LATH_LH1_POSITION                        equ 0001h
LATH_LH1_SIZE                            equ 0001h
LATH_LH1_LENGTH                          equ 0001h
LATH_LH1_MASK                            equ 0002h
LATH_LH2_POSN                            equ 0002h
LATH_LH2_POSITION                        equ 0002h
LATH_LH2_SIZE                            equ 0001h
LATH_LH2_LENGTH                          equ 0001h
LATH_LH2_MASK                            equ 0004h
LATH_LH3_POSN                            equ 0003h
LATH_LH3_POSITION                        equ 0003h
LATH_LH3_SIZE                            equ 0001h
LATH_LH3_LENGTH                          equ 0001h
LATH_LH3_MASK                            equ 0008h
LATH_LH4_POSN                            equ 0004h
LATH_LH4_POSITION                        equ 0004h
LATH_LH4_SIZE                            equ 0001h
LATH_LH4_LENGTH                          equ 0001h
LATH_LH4_MASK                            equ 0010h
LATH_LH5_POSN                            equ 0005h
LATH_LH5_POSITION                        equ 0005h
LATH_LH5_SIZE                            equ 0001h
LATH_LH5_LENGTH                          equ 0001h
LATH_LH5_MASK                            equ 0020h
LATH_LH6_POSN                            equ 0006h
LATH_LH6_POSITION                        equ 0006h
LATH_LH6_SIZE                            equ 0001h
LATH_LH6_LENGTH                          equ 0001h
LATH_LH6_MASK                            equ 0040h
LATH_LH7_POSN                            equ 0007h
LATH_LH7_POSITION                        equ 0007h
LATH_LH7_SIZE                            equ 0001h
LATH_LH7_LENGTH                          equ 0001h
LATH_LH7_MASK                            equ 0080h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 0F81h
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA3_POSN                        equ 0003h
TRISA_TRISA3_POSITION                    equ 0003h
TRISA_TRISA3_SIZE                        equ 0001h
TRISA_TRISA3_LENGTH                      equ 0001h
TRISA_TRISA3_MASK                        equ 0008h
TRISA_TRISA4_POSN                        equ 0004h
TRISA_TRISA4_POSITION                    equ 0004h
TRISA_TRISA4_SIZE                        equ 0001h
TRISA_TRISA4_LENGTH                      equ 0001h
TRISA_TRISA4_MASK                        equ 0010h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h
TRISA_TRISA6_POSN                        equ 0006h
TRISA_TRISA6_POSITION                    equ 0006h
TRISA_TRISA6_SIZE                        equ 0001h
TRISA_TRISA6_LENGTH                      equ 0001h
TRISA_TRISA6_MASK                        equ 0040h
TRISA_TRISA7_POSN                        equ 0007h
TRISA_TRISA7_POSITION                    equ 0007h
TRISA_TRISA7_SIZE                        equ 0001h
TRISA_TRISA7_LENGTH                      equ 0001h
TRISA_TRISA7_MASK                        equ 0080h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 0F82h
// bitfield definitions
TRISB_TRISB0_POSN                        equ 0000h
TRISB_TRISB0_POSITION                    equ 0000h
TRISB_TRISB0_SIZE                        equ 0001h
TRISB_TRISB0_LENGTH                      equ 0001h
TRISB_TRISB0_MASK                        equ 0001h
TRISB_TRISB1_POSN                        equ 0001h
TRISB_TRISB1_POSITION                    equ 0001h
TRISB_TRISB1_SIZE                        equ 0001h
TRISB_TRISB1_LENGTH                      equ 0001h
TRISB_TRISB1_MASK                        equ 0002h
TRISB_TRISB2_POSN                        equ 0002h
TRISB_TRISB2_POSITION                    equ 0002h
TRISB_TRISB2_SIZE                        equ 0001h
TRISB_TRISB2_LENGTH                      equ 0001h
TRISB_TRISB2_MASK                        equ 0004h
TRISB_TRISB3_POSN                        equ 0003h
TRISB_TRISB3_POSITION                    equ 0003h
TRISB_TRISB3_SIZE                        equ 0001h
TRISB_TRISB3_LENGTH                      equ 0001h
TRISB_TRISB3_MASK                        equ 0008h
TRISB_TRISB4_POSN                        equ 0004h
TRISB_TRISB4_POSITION                    equ 0004h
TRISB_TRISB4_SIZE                        equ 0001h
TRISB_TRISB4_LENGTH                      equ 0001h
TRISB_TRISB4_MASK                        equ 0010h
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 0F83h
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC2_POSN                        equ 0002h
TRISC_TRISC2_POSITION                    equ 0002h
TRISC_TRISC2_SIZE                        equ 0001h
TRISC_TRISC2_LENGTH                      equ 0001h
TRISC_TRISC2_MASK                        equ 0004h
TRISC_TRISC3_POSN                        equ 0003h
TRISC_TRISC3_POSITION                    equ 0003h
TRISC_TRISC3_SIZE                        equ 0001h
TRISC_TRISC3_LENGTH                      equ 0001h
TRISC_TRISC3_MASK                        equ 0008h
TRISC_TRISC4_POSN                        equ 0004h
TRISC_TRISC4_POSITION                    equ 0004h
TRISC_TRISC4_SIZE                        equ 0001h
TRISC_TRISC4_LENGTH                      equ 0001h
TRISC_TRISC4_MASK                        equ 0010h
TRISC_TRISC5_POSN                        equ 0005h
TRISC_TRISC5_POSITION                    equ 0005h
TRISC_TRISC5_SIZE                        equ 0001h
TRISC_TRISC5_LENGTH                      equ 0001h
TRISC_TRISC5_MASK                        equ 0020h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h

