GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.inc
#define PWM7DC6                          BANKMASK(PWM7DCH), 4, a
#define PWM7DC7                          BANKMASK(PWM7DCH), 5, a
#define PWM7DC8                          BANKMASK(PWM7DCH), 6, a
#define PWM7DC9                          BANKMASK(PWM7DCH), 7, a
#define PWM7EN                           BANKMASK(PWM7CON), 7, a
#define PWM7MD                           BANKMASK(PMD4), 6, b
#define PWM7OE                           BANKMASK(PWM7CON), 6, a
#define PWM7OUT                          BANKMASK(PWM7CON), 5, a
#define PWM7POL                          BANKMASK(PWM7CON), 4, a
#define RA0                              BANKMASK(PORTA), 0, a
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, a
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, a
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, a
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, a
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, a
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, a
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, a
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, a
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, a
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB2                              BANKMASK(PORTB), 2, a
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB3                              BANKMASK(PORTB), 3, a
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, a
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, a
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, a
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB7                              BANKMASK(PORTB), 7, a
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RC0                              BANKMASK(PORTC), 0, a
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE3), 5, b
#define RC1IF                            BANKMASK(PIR3), 5, b
#define RC1IP                            BANKMASK(IPR3), 5, b
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 7, b
#define RC2IF                            BANKMASK(PIR3), 7, b
#define RC2IP                            BANKMASK(IPR3), 7, b
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3IE                            BANKMASK(PIE4), 1, b
#define RC3IF                            BANKMASK(PIR4), 1, b
#define RC3IP                            BANKMASK(IPR4), 1, b
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4IE                            BANKMASK(PIE4), 3, b
#define RC4IF                            BANKMASK(PIR4), 3, b
#define RC4IP                            BANKMASK(IPR4), 3, b
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC5                              BANKMASK(PORTC), 5, a
#define RC5IE                            BANKMASK(PIE4), 5, b
#define RC5IF                            BANKMASK(PIR4), 5, b
#define RC5IP                            BANKMASK(IPR4), 5, b
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC6                              BANKMASK(PORTC), 6, a
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RC8_9                            BANKMASK(RC1STA), 6, a
#define RC8_92                           BANKMASK(RC2STA), 6, b
#define RC9                              BANKMASK(RC1STA), 6, a
#define RC92                             BANKMASK(RC2STA), 6, b
#define RCD8                             BANKMASK(RC1STA), 0, a
#define RCD82                            BANKMASK(RC2STA), 0, b
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, b
#define RCIDL1                           BANKMASK(BAUD1CON), 6, a
#define RCIDL2                           BANKMASK(BAUD2CON), 6, b
#define RCMT                             BANKMASK(BAUD1CON), 6, a
#define RCMT1                            BANKMASK(BAUD1CON), 6, a
#define RCMT2                            BANKMASK(BAUD2CON), 6, b
#define RD                               BANKMASK(NVMCON1), 0, a
#define RD0                              BANKMASK(PORTD), 0, a
#define RD0PPS0                          BANKMASK(RD0PPS), 0, b
#define RD0PPS1                          BANKMASK(RD0PPS), 1, b
#define RD0PPS2                          BANKMASK(RD0PPS), 2, b
#define RD0PPS3                          BANKMASK(RD0PPS), 3, b
#define RD0PPS4                          BANKMASK(RD0PPS), 4, b
#define RD0PPS5                          BANKMASK(RD0PPS), 5, b
#define RD1                              BANKMASK(PORTD), 1, a
#define RD161                            BANKMASK(T1CON), 1, a
#define RD163                            BANKMASK(T3CON), 1, a
#define RD165                            BANKMASK(T5CON), 1, a
#define RD167                            BANKMASK(T7CON), 1, b
#define RD1PPS0                          BANKMASK(RD1PPS), 0, b
#define RD1PPS1                          BANKMASK(RD1PPS), 1, b
#define RD1PPS2                          BANKMASK(RD1PPS), 2, b
#define RD1PPS3                          BANKMASK(RD1PPS), 3, b
#define RD1PPS4                          BANKMASK(RD1PPS), 4, b
#define RD1PPS5                          BANKMASK(RD1PPS), 5, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD2PPS0                          BANKMASK(RD2PPS), 0, b
#define RD2PPS1                          BANKMASK(RD2PPS), 1, b
#define RD2PPS2                          BANKMASK(RD2PPS), 2, b
#define RD2PPS3                          BANKMASK(RD2PPS), 3, b
#define RD2PPS4                          BANKMASK(RD2PPS), 4, b
#define RD2PPS5                          BANKMASK(RD2PPS), 5, b
#define RD3                              BANKMASK(PORTD), 3, a
#define RD3PPS0                          BANKMASK(RD3PPS), 0, b
#define RD3PPS1                          BANKMASK(RD3PPS), 1, b
#define RD3PPS2                          BANKMASK(RD3PPS), 2, b
#define RD3PPS3                          BANKMASK(RD3PPS), 3, b
#define RD3PPS4                          BANKMASK(RD3PPS), 4, b
#define RD3PPS5                          BANKMASK(RD3PPS), 5, b
#define RD4                              BANKMASK(PORTD), 4, a
#define RD4PPS0                          BANKMASK(RD4PPS), 0, b
#define RD4PPS1                          BANKMASK(RD4PPS), 1, b
#define RD4PPS2                          BANKMASK(RD4PPS), 2, b
#define RD4PPS3                          BANKMASK(RD4PPS), 3, b
#define RD4PPS4                          BANKMASK(RD4PPS), 4, b
#define RD4PPS5                          BANKMASK(RD4PPS), 5, b
#define RD5                              BANKMASK(PORTD), 5, a
#define RD5PPS0                          BANKMASK(RD5PPS), 0, b
#define RD5PPS1                          BANKMASK(RD5PPS), 1, b
#define RD5PPS2                          BANKMASK(RD5PPS), 2, b
#define RD5PPS3                          BANKMASK(RD5PPS), 3, b
#define RD5PPS4                          BANKMASK(RD5PPS), 4, b
#define RD5PPS5                          BANKMASK(RD5PPS), 5, b
#define RD6                              BANKMASK(PORTD), 6, a
#define RD6PPS0                          BANKMASK(RD6PPS), 0, b
#define RD6PPS1                          BANKMASK(RD6PPS), 1, b
#define RD6PPS2                          BANKMASK(RD6PPS), 2, b
#define RD6PPS3                          BANKMASK(RD6PPS), 3, b
#define RD6PPS4                          BANKMASK(RD6PPS), 4, b
#define RD6PPS5                          BANKMASK(RD6PPS), 5, b
#define RD7                              BANKMASK(PORTD), 7, a
#define RD7PPS0                          BANKMASK(RD7PPS), 0, b
#define RD7PPS1                          BANKMASK(RD7PPS), 1, b
#define RD7PPS2                          BANKMASK(RD7PPS), 2, b
#define RD7PPS3                          BANKMASK(RD7PPS), 3, b
#define RD7PPS4                          BANKMASK(RD7PPS), 4, b
#define RD7PPS5                          BANKMASK(RD7PPS), 5, b
#define RDE                              BANKMASK(PORTE), 0, a
#define RE0                              BANKMASK(PORTE), 0, a
#define RE0PPS0                          BANKMASK(RE0PPS), 0, b
#define RE0PPS1                          BANKMASK(RE0PPS), 1, b
#define RE0PPS2                          BANKMASK(RE0PPS), 2, b
#define RE0PPS3                          BANKMASK(RE0PPS), 3, b
#define RE0PPS4                          BANKMASK(RE0PPS), 4, b
#define RE0PPS5                          BANKMASK(RE0PPS), 5, b
#define RE1                              BANKMASK(PORTE), 1, a
#define RE1PPS0                          BANKMASK(RE1PPS), 0, b
#define RE1PPS1                          BANKMASK(RE1PPS), 1, b
#define RE1PPS2                          BANKMASK(RE1PPS), 2, b
#define RE1PPS3                          BANKMASK(RE1PPS), 3, b
#define RE1PPS4                          BANKMASK(RE1PPS), 4, b
#define RE1PPS5                          BANKMASK(RE1PPS), 5, b
#define RE2                              BANKMASK(PORTE), 2, a
#define RE2PPS0                          BANKMASK(RE2PPS), 0, b
#define RE2PPS1                          BANKMASK(RE2PPS), 1, b
#define RE2PPS2                          BANKMASK(RE2PPS), 2, b
#define RE2PPS3                          BANKMASK(RE2PPS), 3, b
#define RE2PPS4                          BANKMASK(RE2PPS), 4, b
#define RE2PPS5                          BANKMASK(RE2PPS), 5, b
#define RE3                              BANKMASK(PORTE), 3, a
#define RE3PPS0                          BANKMASK(RE3PPS), 0, b
#define RE3PPS1                          BANKMASK(RE3PPS), 1, b
#define RE3PPS2                          BANKMASK(RE3PPS), 2, b
#define RE3PPS3                          BANKMASK(RE3PPS), 3, b
#define RE3PPS4                          BANKMASK(RE3PPS), 4, b
#define RE3PPS5                          BANKMASK(RE3PPS), 5, b
#define RE4                              BANKMASK(PORTE), 4, a
#define RE4PPS0                          BANKMASK(RE4PPS), 0, b
#define RE4PPS1                          BANKMASK(RE4PPS), 1, b
#define RE4PPS2                          BANKMASK(RE4PPS), 2, b
#define RE4PPS3                          BANKMASK(RE4PPS), 3, b
#define RE4PPS4                          BANKMASK(RE4PPS), 4, b
#define RE4PPS5                          BANKMASK(RE4PPS), 5, b
#define RE5                              BANKMASK(PORTE), 5, a
#define RE5PPS0                          BANKMASK(RE5PPS), 0, b
#define RE5PPS1                          BANKMASK(RE5PPS), 1, b
#define RE5PPS2                          BANKMASK(RE5PPS), 2, b
#define RE5PPS3                          BANKMASK(RE5PPS), 3, b
#define RE5PPS4                          BANKMASK(RE5PPS), 4, b
#define RE5PPS5                          BANKMASK(RE5PPS), 5, b
#define RE6                              BANKMASK(PORTE), 6, a
#define RE6PPS0                          BANKMASK(RE6PPS), 0, b
#define RE6PPS1                          BANKMASK(RE6PPS), 1, b
#define RE6PPS2                          BANKMASK(RE6PPS), 2, b
#define RE6PPS3                          BANKMASK(RE6PPS), 3, b
#define RE6PPS4                          BANKMASK(RE6PPS), 4, b
#define RE6PPS5                          BANKMASK(RE6PPS), 5, b
#define RE7                              BANKMASK(PORTE), 7, a
#define RE7PPS0                          BANKMASK(RE7PPS), 0, b
#define RE7PPS1                          BANKMASK(RE7PPS), 1, b
#define RE7PPS2                          BANKMASK(RE7PPS), 2, b
#define RE7PPS3                          BANKMASK(RE7PPS), 3, b
#define RE7PPS4                          BANKMASK(RE7PPS), 4, b
#define RE7PPS5                          BANKMASK(RE7PPS), 5, b
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define RF0                              BANKMASK(PORTF), 0, a
#define RF0PPS0                          BANKMASK(RF0PPS), 0, b
#define RF0PPS1                          BANKMASK(RF0PPS), 1, b
#define RF0PPS2                          BANKMASK(RF0PPS), 2, b
#define RF0PPS3                          BANKMASK(RF0PPS), 3, b
#define RF0PPS4                          BANKMASK(RF0PPS), 4, b
#define RF0PPS5                          BANKMASK(RF0PPS), 5, b
#define RF1                              BANKMASK(PORTF), 1, a
#define RF1PPS0                          BANKMASK(RF1PPS), 0, b
#define RF1PPS1                          BANKMASK(RF1PPS), 1, b
#define RF1PPS2                          BANKMASK(RF1PPS), 2, b
#define RF1PPS3                          BANKMASK(RF1PPS), 3, b
#define RF1PPS4                          BANKMASK(RF1PPS), 4, b
#define RF1PPS5                          BANKMASK(RF1PPS), 5, b
#define RF2                              BANKMASK(PORTF), 2, a
#define RF2PPS0                          BANKMASK(RF2PPS), 0, b
#define RF2PPS1                          BANKMASK(RF2PPS), 1, b
#define RF2PPS2                          BANKMASK(RF2PPS), 2, b
#define RF2PPS3                          BANKMASK(RF2PPS), 3, b
#define RF2PPS4                          BANKMASK(RF2PPS), 4, b
#define RF2PPS5                          BANKMASK(RF2PPS), 5, b
#define RF3                              BANKMASK(PORTF), 3, a
#define RF3PPS0                          BANKMASK(RF3PPS), 0, b
#define RF3PPS1                          BANKMASK(RF3PPS), 1, b
#define RF3PPS2                          BANKMASK(RF3PPS), 2, b
#define RF3PPS3                          BANKMASK(RF3PPS), 3, b
#define RF3PPS4                          BANKMASK(RF3PPS), 4, b
#define RF3PPS5                          BANKMASK(RF3PPS), 5, b
#define RF4                              BANKMASK(PORTF), 4, a
#define RF4PPS0                          BANKMASK(RF4PPS), 0, b
#define RF4PPS1                          BANKMASK(RF4PPS), 1, b
#define RF4PPS2                          BANKMASK(RF4PPS), 2, b
#define RF4PPS3                          BANKMASK(RF4PPS), 3, b
#define RF4PPS4                          BANKMASK(RF4PPS), 4, b
#define RF4PPS5                          BANKMASK(RF4PPS), 5, b
#define RF5                              BANKMASK(PORTF), 5, a
#define RF5PPS0                          BANKMASK(RF5PPS), 0, b
#define RF5PPS1                          BANKMASK(RF5PPS), 1, b
#define RF5PPS2                          BANKMASK(RF5PPS), 2, b
#define RF5PPS3                          BANKMASK(RF5PPS), 3, b
#define RF5PPS4                          BANKMASK(RF5PPS), 4, b
#define RF5PPS5                          BANKMASK(RF5PPS), 5, b
#define RF6                              BANKMASK(PORTF), 6, a
#define RF6PPS0                          BANKMASK(RF6PPS), 0, b
#define RF6PPS1                          BANKMASK(RF6PPS), 1, b
#define RF6PPS2                          BANKMASK(RF6PPS), 2, b
#define RF6PPS3                          BANKMASK(RF6PPS), 3, b
#define RF6PPS4                          BANKMASK(RF6PPS), 4, b
#define RF6PPS5                          BANKMASK(RF6PPS), 5, b
